---
kind: method
id: M:Autodesk.Revit.DB.FailureMessage.HasResolutions
source: html/a44bb0ed-46d2-c955-d6a0-294896e3448d.htm
---
# Autodesk.Revit.DB.FailureMessage.HasResolutions Method

Checks if the failure has any resolutions.

## Syntax (C#)
```csharp
public bool HasResolutions()
```

## Returns
True if the failure has any resolutions, false otherwise.